from django.test import TestCase

# Create your tests here.
# import re
# a='/asstes/assets-add-update-g-12343.html'
# print(re.search('-g-', a))

from assets.models import *
a=['2007', '笔记本', 'E450', '', 43246.0, '在库', '', '', '']
b=['2016ap', '笔记本', 'E470', '234324', 43244.0, '在库', '', '', '']
c=['2016apm', '笔记本', 'E450', 'dddd', 43250.0, '在库', '', '', '']
d=['54545', '笔记本', 'E450', '234324', 43244.0, '在库', '', '', '']
e=['2016', '笔记本', 'E450', 'dfsdf', 43244.0, '借用', 'gong', '', 43236.0]
f=['102', '台式机', 'GTX1050', '213123', 43230.0, '领用', '1111', '', 43249.0]
g=['1000', '台式机', 'GTX1050', '8G', 43245.0, '维修', '', '', '']